In [ ]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report, confusion_matrix
import matplotlib.pyplot as plt
import csv

In [ ]:
train_data = pd.read_csv(r"https://raw.githubusercontent.com/kapilbhise/univ.ai-hackthon/master/Training%20Data.csv")
test_data = pd.read_csv(r"https://raw.githubusercontent.com/kapilbhise/univ.ai-hackthon/master/Test%20Data.csv")

In [ ]:
print(train_data.shape)
train_data.head()

(252000, 13)

   Id   income  age  ...  current_job_years  current_house_years  risk_flag
0   1  1303835   23  ...                  3                   13          0
1   2  7574516   40  ...                  9                   13          0
2   3  3991815   66  ...                  4                   10          0
3   4  6256451   41  ...                  2                   12          1
4   5  5768871   47  ...                  3                   14          1

[5 rows x 13 columns]

In [ ]:
print(test_data.shape)
test_data.head()

(28000, 12)

   id   income  age  ...  state  current_job_years  current_house_years
0   1  7393090   59  ...      0                  4                   13
1   2  1215004   25  ...      1                  5                   10
2   3  8901342   50  ...      1                  9                   14
3   4  1944421   49  ...      1                  3                   12
4   5    13429   25  ...      0                 13                   11

[5 rows x 12 columns]

In [ ]:
train_data["profession"]=pd.factorize(train_data.profession)[0]
train_data["city"]=pd.factorize(train_data.city)[0]
train_data["state"]=pd.factorize(train_data.state)[0]
train_data["married"]=pd.factorize(train_data.married)[0]
train_data["house_ownership"]=pd.factorize(train_data.house_ownership)[0]
train_data["car_ownership"]=pd.factorize(train_data.car_ownership)[0]

test_data["profession"]=pd.factorize(test_data.profession)[0]
test_data["city"]=pd.factorize(test_data.city)[0]
test_data["state"]=pd.factorize(test_data.state)[0]
test_data["married"]=pd.factorize(test_data.married)[0]
test_data["house_ownership"]=pd.factorize(test_data.house_ownership)[0]
test_data["car_ownership"]=pd.factorize(test_data.car_ownership)[0]

In [ ]:
xtrain=train_data.drop("risk_flag",axis=1)
ytrain=train_data["risk_flag"]

In [ ]:
DTClassifier= DecisionTreeClassifier(criterion='entropy', random_state=100)
DTClassifier.fit(xtrain,ytrain)

y_pred= DTClassifier.predict(test_data)

print(y_pred)

count=0
for i in y_pred:
  if i==1:
    count+=1
print(count)

id=test_data["id"]
id=np.array(id)
d={"id":id,"risk_flag":y_pred}
df=pd.DataFrame(d)
print(df)
df.to_csv("prediction.csv",index=False)

[0 0 0 ... 0 0 0]
4320
          id  risk_flag
0          1          0
1          2          0
2          3          0
3          4          0
4          5          1
...      ...        ...
27995  27996          0
27996  27997          0
27997  27998          0
27998  27999          0
27999  28000          0

[28000 rows x 2 columns]